Documents/КорректировкаВзаимоРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>КорректировкаВзаимоРасчетов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Взаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>Взаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/КорректировкаВзаимоРасчетов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставити вміст обробника.
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыОстаткиИОбороты.Контрагент КАК Контрагент,
	               |	СУММА(ЕСТЬNULL(ВзаиморасчетыОстаткиИОбороты.СуммаПриход, 0)) КАК СуммаПриход,
	               |	СУММА(ЕСТЬNULL(ВзаиморасчетыОстаткиИОбороты.СуммаРасход, 0)) КАК СуммаРасход
	               |ИЗ
	               |	РегистрНакопления.Взаиморасчеты.ОстаткиИОбороты КАК ВзаиморасчетыОстаткиИОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВзаиморасчетыОстаткиИОбороты.Контрагент";
	
	Движения.Взаиморасчеты.Очистить();
	Движения.Взаиморасчеты.Записать();
	Движения.Взаиморасчеты.Записывать = Истина;
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для каждого стр из ТЗ цикл
		
		Если стр.Контрагент = Отправитель тогда
			ДоступнаяСуммаСписания = стр.СуммаПриход - стр.СуммаРасход;
			Если ДоступнаяСуммаСписания >= 0 тогда
				Сообщить("Отправитель нам ничего не должен!");
				отказ = истина;
				Возврат;
			КонецЕсли;
		Иначе
			МаксимальнаяСуммаКСписанию = стр.СуммаПриход - стр.СуммаРасход;
			Если МаксимальнаяСуммаКСписанию <= 0 тогда
				Сообщить("Мы ничего не должны получателю!");
				отказ = истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если (Сумма + ДоступнаяСуммаСписания) > 0 тогда
		Сообщить("Сумма списания превышает долг отправителя перед нами!");
		отказ = истина;
		Возврат;
	ИначеЕсли Сумма > МаксимальнаяСуммаКСписанию тогда
		Сообщить("Сумма больше нашего долга перед получателем!");
		отказ = истина;
		Возврат;
	Иначе
		ТаблицаКор = Движения.Взаиморасчеты.Выгрузить();
	
		ДвижОтпр = ТаблицаКор.Добавить();
		
		ДвижОтпр.Период = Дата;
		ДвижОтпр.Активность = Истина;
		ДвижОтпр.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижОтпр.Контрагент = Отправитель; 
		ДвижОтпр.Сумма = Сумма;
		
		ДвижПолуч = ТаблицаКор.Добавить();
		ДвижПолуч.Период = Дата;
		ДвижПолуч.Активность = Истина;
		ДвижПолуч.ВидДвижения = ВидДвиженияНакопления.Расход;
		ДвижПолуч.Контрагент = Получатель; 
		ДвижПолуч.Сумма = Сумма;

		Движения.Взаиморасчеты.Загрузить(ТаблицаКор);
			
	КонецЕсли;
	
КонецПроцедуры
